app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "chonetown"], ["body", "porque vengo de chone"], ["created_at", "2020-03-31 20:01:19.751706"], ["updated_at", "2020-03-31 20:01:19.751706"]]
---
    def create
        @article = Article.new(article_params)
        @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", ""], ["updated_at", "2020-03-31 23:44:57.292104"], ["id", 4]]
---
    def update
        @article = Article.find(params[:id])
        @article.update(article_params)